/*
1/ Найти все блоки статей с помощью квериселекторолл
2/ Создать цикл и переменную с одной статьёй, чтобы обратиться к одной статье 
3/ Добавить внутрь цикла условную конструкцию и сравнивать значения атрибута статьи со значением фильтра (свойство value) 
4/ То есть нам нужно найти фильтр и получить его значение, когда пользователь выбирает новую категорию. Для этого используем обработчик событий onchange
5/ Чтобы реализовать скрытие ненужных новостей, нужно в css добавить класс hidden и прописать ему display:none; 
*/

let selectItems = document.querySelectorAll('option');

for (let selectItem of selectItems) {
	selectItem.onclick = function () {
		console.log('Клик сработал!');
	}
}